<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0f39b62ed9f67ea545da17634226f873f23c1c73bf856b20ef5bcf92f999e25e","plan_job_ref":"Job Plan Airflow DAGs #494 at https://github.com/cal-itp/data-infra/actions/runs/17111130505","plan_out_hash":"ed9abd5e69fe455e08c49f2ba74f1cc965212d7359748570d690bf69564767cc","plan_hash":"0e3b7d39a6502e1c1b1507d98f05e1a851da68e1e17b83977e6173a5e2a213ed","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "4n96EA==" -> (known after apply)
!~      detect_md5hash      = "5Pl4suR1I3b9+9ReEi7/sw==" -> "different hash"
!~      generation          = 1753141475886918 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_all_dag.py"
!~      md5hash             = "5Pl4suR1I3b9+9ReEi7/sw==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "wyUzzg==" -> (known after apply)
!~      detect_md5hash      = "0T0v/tgbSCNEvB0BzxwpSA==" -> "different hash"
!~      generation          = 1754957461290480 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "0T0v/tgbSCNEvB0BzxwpSA==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "q1fYBg==" -> (known after apply)
!~      detect_md5hash      = "JGvU0IztIxJQck4z5C4+4A==" -> "different hash"
!~      generation          = 1753143276373428 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "JGvU0IztIxJQck4z5C4+4A==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "5/NgRA==" -> (known after apply)
!~      detect_md5hash      = "MdNvoU7wORHElOK39j/W7g==" -> "different hash"
!~      generation          = 1750272586291252 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"
!~      md5hash             = "MdNvoU7wORHElOK39j/W7g==" -> (known after apply)
        name                = "data/warehouse/models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #494](https://github.com/cal-itp/data-infra/actions/runs/17111130505)